app/views/organization_units/_form.html.erb

    <%= f.input :accept_petition, label_html: {class: 'transparent_label'} %>
  <%= f.input :organization_type_id, prompt: true, collection: OrganizationType.all, class: "form-control show-tick" %>
---
SELECT `organization_types`.* FROM `organization_types`