app/controllers/organization_units_controller.rb

SELECT  `organization_units`.* FROM `organization_units` WHERE (parent_organization_unit_id is null) ORDER BY `organization_units`.`id` ASC LIMIT 1
---
  def index
    @organization_units = current_user.organization_unit == OrganizationUnit.top_organization_unit ? OrganizationUnit.all : current_user.organization_unit.sub_units || []

SELECT  `organization_units`.* FROM `organization_units` WHERE (parent_organization_unit_id is null) ORDER BY `organization_units`.`id` ASC LIMIT 1
---
  def load_petition_sub_units
    @parent  = OrganizationUnit.find(params[:node])

SELECT COUNT(*) AS count_all, facilities.name AS facilities_name FROM `people` INNER JOIN `facilities` ON `facilities`.`id` = `people`.`facility_id` WHERE `people`.`organization_unit_id` = 1 GROUP BY facilities.name
---
  def org_unit_facilities
    unless current_user.parent_org_unit.sub_organization_units.blank?
      health_workres = current_user.parent_org_unit.sub_organization_units.
          map{|x| [x.to_s => x.sub_people.count]}.flatten.inject({}){|hash, og| hash.merge!(og)}
    else
      health_workres = current_user.parent_org_unit.people.joins(:facility).group('facilities.name').count