app/controllers/petitions_controller.rb

    def set_petition
      @petition = Petition.find(params[:id])
---
SELECT  `petitions`.* FROM `petitions` WHERE `petitions`.`id` = 0 LIMIT 1