app/controllers/users_controller.rb

SELECT  `organization_units`.* FROM `organization_units` WHERE (parent_organization_unit_id is null) ORDER BY `organization_units`.`id` ASC LIMIT 1
---
  def load_users
    @organization_unit  = OrganizationUnit.find(params[:node])